Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: If the connection is lost and you reconnect with mysql_ping(), the thread ID will change.
pt_br: Se a conexão for perdida e você reconectar com mysql_ping(), o ID da thread irá muda.

source: This means you should not get the thread ID and store it for later.
pt_br: Isto indica que você não deve guardar o pegar ID e guarda-lo para depois.

source: You should get it when you need it.
pt_br: Você deve pega-lo quando você precisar dele.

source: Example 1. mysql_thread_id() example
pt_br: Exemplo mysql_thread_id()

source: See also: mysql_ping(), mysql_list_processes().
pt_br: Veja também: mysql_ping(), mysql_list_processes().

source: mysql_unbuffered_query() sends a SQL query query to MySQL, without fetching and buffering the result rows automatically, as mysql_query() does.
pt_br: Descrição

source: On the other hand, you can start working on the result set immediately after the first row has been retrieved: you don 't have to wait until the complete SQL query has been performed.
pt_br: mysql_unbuffered_query() envia uma query SQL para MySQL, sem retornar e colocar em buffer as linhas do resultado automaticamente, como mysql_query() faz. por um lado, isto salva uma quantidade considerável de memória em query que produzem um resultado grandes. por outro lado, você pode começãr a trbalhar com o resultado imediatamente após a primeira linha ser retornada: você não tem que esperar que toda a query SQL seja realizada.

source: When using multiple DB-connects, you have to specify the optional parameter link_identifier.
pt_br: Quando usar multiplas conexões com o banco de dados, você deve especificar o parametro opcional link_identifier.

source: It defaults to MYSQL_USE_RESULT, so the result is not buffered.
pt_br: O padrão é MYSQL_USE_RESULT, assim o resultado não é colocado no buffer.

source: See also mysql_query() for the counterpart of this behaviour.
pt_br: Veja também mysql_query() para a contraparte desta função.

source: You cannot use mysql_num_rows() on a result set returned from mysql_unbuffered_query().
pt_br: Os beneficios de mysql_unbuffered_query() vem com um custo: você não pode usar mysql_num_rows() no resultado retornado por mysql_unbuffered_query().

source: You also have to fetch all result rows from an unbuffered SQL query, before you can send a new SQL query to MySQL.
pt_br: Você tmbém tem que pegar todas as linhas de uma query SQL sem buffer antes de poder enviar uma nova query SQL para o MySQL.

source: This function implements a sort algorithm that orders alphanumeric strings in the way a human being would.
pt_br: Essa função implementa o algoritmo de ordenação que ordena strings alfanuméricas da forma que os humanos fariam.

source: This is described as a "natural ordering".
pt_br: Essa forma de ordenação é denominada "ordenação natural".

source: natcasesort() is a case insensitive version of natsort().
pt_br: natcasesort() é uma versão de natsort() que não diferencia letras maiúsculas e minúsculas.

source: See natsort() for an example of the difference between this algorithm and the regular computer string sorting algorithms.
pt_br: Veja natsort() para saber a diferença entre esse algoritmo e os algoritmos utlizados normalmente para ordenação de strings.

source: For more information see:
pt_br: Para mais informações veja:

source: See also sort(), natsort(), strnatcmp(), and strnatcasecmp().
pt_br: Veja também sort(), natsort(), strnatcmp() e strnatcasecmp().

source: An example of the difference between this algorithm and the regular computer string sorting algorithms (used in sort()) can be seen below:
pt_br: Um exemplo da diferença entre esse algoritmo e o algoritmo com o qual o computador classifica strings (usado em sort()) pode ser visto abaixo:

source: Example 1. natsort() example
pt_br: Exemplo de natsort()

source: ?php $array1 = $array2 = array ("img12.png", "img10.png", "img2.png", "img1.png"); sort($array1); echo "Standard sorting\n"; print_r($array1); natsort($array2); echo "\nNatural order sorting\n"; print_r($array2);?
pt_br: $array1 = $array2 = array ("img12.png", "img10.png", "img2.png", "img1.png"); sort($array1); echo "Classificação normal\n"; print_r($array1); natsort($array2); echo "\nClassificação da \"ordem natural\"\n"; print_r($array2);

source: The code above will generate the following output:
pt_br: O código acima geraria a seguinte saída:

source: Standard sorting Array ([0] = img1.png [1] = img10.png [2] = img12.png [3] = img2.png) Natural order sorting Array ([3] = img1.png [2] = img2.png [1] = img10.png [0] = img12.png)
pt_br: Classificação normal Array ([0] = img1.png [1] = img10.png [2] = img12.png [3] = img2.png) Classificação da "ordem natural "Array ([3] = img1.png [2] = img2.png [1] = img10.png [0] = img12.png)

source: If you' re wanting to maintain index / value associations, consider using usort($arr, 'strnatcmp').
pt_br: Se quiser manter a correlação entre chaves e valores, considere a possibilidade de utilizar usort( $arr, 'strnatcmp').

source: See also natcasesort(), strnatcmp(), and strnatcasecmp().
pt_br: Veja também natcasesort(), strnatcmp() e strnatcasecmp().

source: Example 1. ncurses_getmouse() example
pt_br: Exemplo 1. ncurses_getmouse() example

source: Example 1. ncurses_mousemask() example
pt_br: Exemplo 1. ncurses_mousemask() example

source: Returns the array element in the next place that 's pointed by the internal array pointer, or FALSE if there are no more elements.
pt_br: Retorna o elemento do array que está na próxima posição que é apontada pelo ponteiro interno do array, ou FALSE caso não existam mais elementos.

source: next() behaves like current(), with one difference.
pt_br: next() funciona de forma semelhante a current(), com uma diferença.

source: It advances the internal array pointer one place forward before returning the element.
pt_br: Ele avança o ponteiro interno do array em uma posição antes de retornar o elemento.

source: That means it returns the next array element and advances the internal array pointer by one.
pt_br: Isso significa que ela retorna o próximo elemento do array avançando o ponteiro interno em uma posição.

source: If advancing the internal array pointer results in going beyond the end of the element list, next() returns FALSE.
pt_br: Se o ponteiro interno apontar para além do final da lista de elementos, next() retorna FALSE.

source: If the array contains empty elements, or elements that have a key value of 0 then this function will return FALSE for these elements as well.
pt_br: Se o array contiver elementos vazios, ou se elementos tiverem chaves com 0 como valor então essa função retorna FALSE Se o array contiver elementos vazios, ou se elementos tiverem chaves com 0 como valor então essa função retorna FALSE para esses elementos.

source: To properly traverse an array which may contain empty elements or elements with key values of 0 see the each() function.
pt_br: Para percorrer um array que pode conter elementos vazios ou elementos que tenham chaves com 0 como valor veja a função each().

source: See also current(), end(), prev(), and reset().
pt_br: Veja também current(), end(), prev() e reset().

source: Returns string with 'br /' inserted before all newlines.
pt_br: Retorna string com 'br /' inserido antes de todas as newlines.

source: Starting with PHP 4.0.5, nl2br() is now XHTML compliant.
pt_br: Começa no PHP 4.0.5, nl2br() está agora em XHTML complacente.

source: All versions before 4.0.5 will return string with 'br' inserted before newlines instead of 'br /'.
pt_br: Todas as versões anteriores a 4.0.5 retornarão string com 'br' inserido antes das newlines ao invés de 'br /'.

source: See also htmlspecialchars(), htmlentities(), wordwrap(), and str_replace().
pt_br: Veja também htmlspecialchars(), htmlentities() e wordwrap().

source: number_format() returns a formatted version of number.
pt_br: Descrição

source: This function accepts either one, two or four parameters (not three):
pt_br: number_format() retorna uma versão formatada de number.

source: If only one parameter is given, number will be formatted without decimals, but with a comma (",") between every group of thousands.
pt_br: Se apenas um parâmetro é dado, number será formatado sem decimais, mas com uma virgula (",") entre cada grupo de milhar.

source: If two parameters are given, number will be formatted with decimals decimals with a dot (".") in front, and a comma (" ,") between every group of thousands.
pt_br: Se dois parâmetros são dados, number será formatado com o número de casas decimais especificadas em decimals com um ponto (".") na frente, e uma vírgula (" ,") entre cada grupo de milhar.

source: If all four parameters are given, number will be formatted with decimals decimals, dec_point instead of a dot (".") before the decimals and thousands_sep instead of a comma (" ,") between every group of thousands.
pt_br: Se todos os quatro parâmetros forem dados, number será formatado com o número de casas decimais em decimals, dec_point ao invés do ponto (".") antes das casas decimais e thousands_sep ao invés de uma vírgula (" ,") entre os grupos de milhares.

source: Only the first character of thousands_sep is used.
pt_br: Somente o primeiro caractere de thousands_sep é usado.

source: For example, if you use foo as thousands_sep on the number 1000, number_format() will return 1f000.
pt_br: Por exemplo, se você usar foo como o parâmetro thousands_sep no número 1000, number_format() irá retornar 1f000.

source: Example 1. number_format() Example
pt_br: Exemplo number_format()

source: For instance, French notation usually use two decimals, comma (',') as decimal separator, and space (' ') as thousand separator.
pt_br: Por exemplo, a notação Francesa usa duas casas decimais, vírgula (',') como separador decimal, e espaço (' ') como separador de milhar.

source: This is achieved with this line:
pt_br: Isto é feito com a linha:

source: ?php $number = 1234.56; / / english notation (default) $english_format_number = number_format($number); / / 1,234 / / French notation $nombre_format_francais = number_format($number, 2, ',',' '); / / 1 234,56 $number = 1234.5678; / / english notation without thousands seperator $english_format_number = number_format($number, 2, '.', ''); / / 1234.57?
pt_br: ?php $number = 1234.56; / / Notação Inglesa (padrão) $english_format_number = number_format($number); / / 1,234 / / Notação Francesa $nombre_format_francais = number_format($number, 2, ',',' '); / / 1 234,56 $number = 1234.5678; / / Notação Inglesa com separador de milhar $english_format_number = number_format($number, 2, '.', ''); / / 1234.57?

source: See also: sprintf(), printf() and sscanf().
pt_br: Veja também: sprintf(), printf() e sscanf().

source: Example 1. ob_gzhandler() Example
pt_br: Exemplo 1. ob_gzhandler() Example

source: Example 1. ob_iconv_handler() example:
pt_br: Exemplo 1. ob_iconv_handler() example:

source: This function will turn output buffering on.
pt_br: Description

source: Object property and method call overloading
pt_br: Sobrecarga de propriedades e métodos de objetos

source: OCIDefineByName() binds PHP variables for fetches of SQL-Columns.
pt_br: Description

source: OCIError() returns the last error found.
pt_br: Description

source: OCIInternalDebug() enables internal debug output.
pt_br: Description

source: OCILogOff() closes an Oracle connection.
pt_br: Description

source: OCIParse() parses the query using conn.
pt_br: Description

source: OCIServerVersion
pt_br: Exemplo 1.

source: Returns the decimal equivalent of the octal number represented by the octal_string argument.
pt_br: Retornar o decimal equivalente do número octal representado pelo argumento octal_string.

source: The largest number that can be converted is 17777777777 or 2147483647 in decimal.
pt_br: O maior número que pode ser convertido é 17777777777 ou 2147483647 em decimal.

source: See also decoct().
pt_br: Veja também decoct().

source: (ODBC SQL types affected:
pt_br: Description

source: Lists all columns in the requested range.
pt_br: Description

source: All pending transactions on connection_id are committed.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Returns an ODBC connection id or 0 (FALSE) on error.
pt_br: Description

source: Returns FALSE on error, and an array upon success.
pt_br: Description

source: Returns FALSE on error.
pt_br: Description

source: Executes a statement prepared with odbc_prepare() .Returns TRUE on success or FALSE on failure.
pt_br: Executes a statement prepared with odbc_prepare() .Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Example 1. odbc_fetch_into() pre 4.0.6 example
pt_br: Exemplo 1. odbc_fetch_into() pre 4.0.6 example

source: Example 2. odbc_fetch_into() 4.0.6 example
pt_br: Exemplo 2. odbc_fetch_into() 4.0.6 example

source: Example 3. odbc_fetch_into() 4.2.0 example
pt_br: Exemplo 3. odbc_fetch_into() 4.2.0 example

source: Always returns TRUE.
pt_br: Description

source: Lists all procedures in the requested range.
pt_br: Description

source: Returns the number of rows in the result or FALSE on error.
pt_br: Description

source: Returns the contents of the field.
pt_br: Description

source: (PHP 3 = 3.0.17, PHP 4)
pt_br: odbc_tables

source: Lists all tables in the requested range.
pt_br: Description

source: Returns a directory handle to be used in subsequent closedir(), readdir(), and rewinddir() calls.
pt_br: Descrição

source: You can suppress the error output of opendir() by prepending `@ 'to the front of the function name.
pt_br: Retorna um handle de diretório para ser usado em chamadas subsequentes a closedir(), readdir(), e rewinddir().

source: Example 1. opendir() example
pt_br: Você pode suprimir o erro na saída de opendir() no seu script ao se inserir `@ 'na frente do nome da função.

source: See also is_dir().
pt_br: Exemplo 1. exemplo de opendir()

source: getcwd
pt_br: Próxima

source: readdir
pt_br: Acima

source: Table 1. openlog() Options
pt_br: Tabela 1. openlog() Options

source: Table 2. openlog() Facilities
pt_br: Tabela 2. openlog() Facilities

source: Example 1. openssl_csr_new() example - creating a self-signed-certificate
pt_br: Exemplo 1. openssl_csr_new() example - creating a self-signed-certificate

source: Example 1. openssl_csr_sign() example - signing a CSR (how to implement your own CA)
pt_br: Exemplo 1. openssl_csr_sign() example - signing a CSR (how to implement your own CA)

source: Example 1. openssl_error_string() example
pt_br: Exemplo 1. openssl_error_string() example

source: If successful the opened data is returned in open_data.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Example 1. openssl_open() example
pt_br: Exemplo 1. openssl_open() example

source: Example 1. openssl_pkcs7_decrypt() example
pt_br: Exemplo 1. openssl_pkcs7_decrypt() example

source: Example 1. openssl_pkcs7_encrypt() example
pt_br: Exemplo 1. openssl_pkcs7_encrypt() example

source: Example 1. openssl_pkcs7_sign() example
pt_br: Exemplo 1. openssl_pkcs7_sign() example

source: Example 1. openssl_seal() example
pt_br: Exemplo 1. openssl_seal() example

source: Example 1. openssl_sign() example
pt_br: Exemplo 1. openssl_sign() example

source: Example 1. openssl_verify() example
pt_br: Exemplo 1. openssl_verify() example

source: Table 1. openssl_x509_checkpurpose() purposes
pt_br: Tabela 1. openssl_x509_checkpurpose() purposes

source: Returns TRUE if the bind succeeds, otherwise FALSE.
pt_br: Description

source: Returns TRUE if the close succeeds, otherwise FALSE.
pt_br: Description

source: Details about the error can be retrieved using the ora_error() and ora_errorcode() functions.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Fetches a row of data into an array.
pt_br: Description

source: Example 1. ora_fetch_into()
pt_br: Exemplo 1. ora_fetch_into()

source: Returns the column data.
pt_br: Description

source: Opens an Oracle cursor associated with connection.
pt_br: Description

source: Returns the ASCII value of the first character of string.
pt_br: Retorna o valor ASCII do primeiro caractere de string.

source: This function complements chr().
pt_br: Esta função complementa chr().

source: Example 1. ord() example
pt_br: Exemplo ord()

# if (ord($str) == 10) {echo "The first character of $str is a line feed. ";}
source: if (ord($str) == 10) {echo "The first character of \$str is a line feed.\n";}
pt_br: if (ord($str) == 10) {echo "O primeiro caractere de \$str é uma nova linha.\n";}

source: See also chr().
pt_br: Veja também chr().

source: The overload() function will enable property and method call overloading for a class identified by class_name.
pt_br: A função overload() ativa a chamada sobrecarregada de propriedades e métodos para a classe identificada por class_name.

source: See an example in the introductory section of this part.
pt_br: Veja o exemplo na seção introdutória desse módulo.

source: Example 1. ovrimos_connect() Example
pt_br: Exemplo 1. ovrimos_connect() Example

source: (PHP 4 = 4.0.3)
pt_br: ovrimos_exec

source: ovrimos_exec() is used to execute an SQL statement.
pt_br: Description

source: ovrimos_execute() is used to execute an SQL statement.
pt_br: Description

source: ovrimos_fetch_row() is used to fetch a row from the result set.
pt_br: Description

source: A fetch row example
pt_br: Exemplo 1.

source: ovrimos_free_result() is used to free the result_id.
pt_br: Description

source: ovrimos_num_fields() is used to get the number of columns.
pt_br: Description

source: ovrimos_prepare() is used to prepare an SQL statement.
pt_br: Description

source: Example 3. ovrimos_result_all example
pt_br: Exemplo 3. ovrimos_result_all example

source: ovrimos_result() is used to retrieve the output column.
pt_br: Description

source: Example 1. pack() format string
pt_br: Exemplo 1. pack() format string

source: parse_ini_file() loads in the ini file specified in filename, and returns the settings in it in an associative array.
pt_br: parse_ini_file() carrega o arquivo INI informado no nomedoarquivo, e retorna as configurações dele em um array associativo.

source: By setting the last process_sections parameter to TRUE, you get a multidimensional array, with the section names and settings included.
pt_br: Ao usar processar_secoes como TRUE, você receberá um array multidimensional, com os nomes das seções e os parametros incluidos.

source: The default for process_sections is FALSE
pt_br: O padrão (default) para processar_secoes é FALSE.

source: This function has nothing to do with the php.ini file.
pt_br: Esta função não tem nada a ver com o arquivo php.ini.

source: It is already processed, the time you run your script.
pt_br: Este já é processado na hora que você executa o script.

source: This function can be used to read in your own application 's configuration files.
pt_br: Esta função pode ser usada para ler os arquivos de configuração de sua própria aplicação.

source: If a value in the ini file contains any non-alphanumeric characters it needs to be enclosed in double-quotes (").
pt_br: Se o arquivo INI tem qualquer caracter não alfanumérico, eles precisam estar delimitados por aspas (").

source: The structure of the ini file is similar to that of the php.ini 's.
pt_br: A estrutura do arquivo ini é similar a do php.ini.

source: Constants may also be parsed in the ini file so if you define a constant as an ini value before running parse_ini_file(), it will be integrated into the results.
pt_br: Se o arquivo INI que você está tentando interpretar estiver mal formado, o PHP pára.

source: Only ini values are evaluated.
pt_br: Exemplo 1.

source: ; This is a sample configuration file; Comments start with ';', as in php.ini [first_section] one = 1 five = 5 animal = BIRD [second_section] path = / usr / local / bin URL = "http: / /www.example.com / ~username "
pt_br: ; Este é um arquivo de configuração de exemplo; Comentário começam com ';', como no php.ini [primeira_secao] um = 1 cinco = 5 [segunda_secao] path = / usr / local / bin URL = "http: / /www.example.com / ~username "

source: Example 2. parse_ini_file() example
pt_br: Exemplo 2. exemplo de parse_ini_file()

source: ?php define ('BIRD', 'Dodo bird'); / / Parse without sections $ini_array = parse_ini_file("sample.ini"); print_r($ini_array); / / Parse with sections $ini_array = parse_ini_file("sample.ini", TRUE); print_r($ini_array);?
pt_br: ?php / / Parse sem as seções $ini_array = parse_ini_file( "exemplo.ini"); print_r($ini_array); / / Parse com as seções $ini_array = parse_ini_file("exemplo.ini", TRUE); print_r($ini_array);?

source: Would produce:
pt_br: Irá produzir:

source: Array ([one] = 1 [five] = 5 [animal] = Dodo bird [path] = / usr / local / bin [URL] = http: / /www.example.com / ~username) Array ([first_section] = Array ([one] = 1 [five] = 5 [animal] = Dodo bird) [second_section] = Array ([path] = / usr / local / bin [URL] = http: / /www.example.com / ~username))
pt_br: Array ([um] = 1 [cinco] = 5 [path] = / usr / local / bin [URL] = http: / /www.example.com / ~username) Array ([primeira_secao] = Array ([um] = 1 [cinco] = 5) [segunda_secao] = Array ([path] = / usr / local / bin [URL] = http: / /www.example.com / ~username))

source: Parses str as if it were the query string passed via an URL and sets variables in the current scope.
pt_br: Converte str como se ela tivesse sido passada via URL e define o valor das variáveis.

source: If the second parameter arr is present, variables are stored in this variable as an array elements instead.
pt_br: Se o segundo parâmetro arr estiver presente, as variáveis são colocadas nesta variável como uma matriz de elementos.

source: Support for the optional second parameter was added in PHP 4.0.3.
pt_br: Suporte para o segundo parâmetro, que é opcional, foi adicionado no PHP 4.0.3.

source: Also, you may want to read the section on variables from outside of PHP.
pt_br: Para pegar a QUERY_STRING atual, você deve usar a variável $_SERVER[ 'QUERY_STRING']. também você deve querer ler a seção sobre variáveis de fora do PHP.

source: Using parse_str()
pt_br: Usando parse_str()

source: See also parse_url(), pathinfo(), set_magic_quotes_runtime(), and urldecode().
pt_br: Veja também parse_url(), pathinfo(), set_magic_quotes_runtime(), e urldecode().

source: This function returns an associative array returning any of the various components of the URL that are present.
pt_br: parse_url

source: query - after the question mark?
pt_br: Descrição

source: This function is not meant to validate the given URL, it only breaks it up into the above listed parts.
pt_br: Esta função retorna um array associativo qualquer um dos vários componentes de uma URL que estão presentes.

source: pathinfo() returns an associative array containing information about path.
pt_br: pathinfo() retorna um array associatico contendo informações sobre o path.

source: The following array elements are returned: dirname, basename and extension.
pt_br: O seguinte elementos do array são retornados: dirname, basename e extension.

source: Example 1. pathinfo() Example
pt_br: Exemplo de pathinfo()

source: ?php $path_parts = pathinfo( "/ www / htdocs / index.html"); echo $path_parts["dirname"]. "\n"; echo $path_parts["basename"]. "\n"; echo $path_parts["extension"]. "\n";?
pt_br: ?php $partes_do_path = pathinfo( "/ www / htdocs / index.html"); echo $partes_do_path["dirname"]. "\n"; echo $partes_do_path["basename"]. "\n"; echo $partes_do_path["extension"]. "\n";?

source: For information on retrieving the current path info, read the section on predefined reserved variables.
pt_br: Para informações na recuperação da informação do diretório atual, leia a seção variáveis predefinidas reservadas.
